In [1]:
from components.points_generator import PointsGenerator

pg = PointsGenerator(10)

pg.generate_points()

pg.generated_points

{0: {'coords': (194, 179), 'point_type': 'demand'},
 1: {'coords': (139, 104), 'point_type': 'magazine'},
 2: {'coords': (146, 134), 'point_type': 'demand'},
 3: {'coords': (152, 192), 'point_type': 'magazine'},
 4: {'coords': (111, 144), 'point_type': 'demand'},
 5: {'coords': (156, 151), 'point_type': 'magazine'},
 6: {'coords': (187, 113), 'point_type': 'supply'},
 7: {'coords': (158, 170), 'point_type': 'magazine'},
 8: {'coords': (158, 153), 'point_type': 'supply'},
 9: {'coords': (128, 184), 'point_type': 'magazine'}}

In [5]:
pg.demand_df

   id  Tuna  Oranges  Uran
0   0    58        3   105
1   2   138        0     3
2   4    92        2    39

In [6]:
pg.supply_df

   id  Tuna  Oranges  Uran
0   6     6       68    32
1   8    12      128    42

In [7]:
pg.magazines_points

[9, 3, 1, 7, 5]